Revit 2024 API
FormattedText Constructor
 Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public FormattedText()
Visual Basic
Public Sub New
Visual C++
public:
FormattedText()
See Also
FormattedText Class
FormattedText Overload
Autodesk.Revit.DB Namespace